# IFC_DMEnableEntry

## Description
Enables/Disables indicated entry from current IFC Data Mapping is enabled.

```pascal
FUNCTION IFC_DMEnableEntry(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				bEnable        : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMEnableEntry(inStrObjName, inStrEntryName, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|bEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC